---
kind: method
id: M:Autodesk.Revit.DB.GroupSet.Clear
source: html/5a2fba89-766c-6b1a-caa4-5a17e17c81d9.htm
---
# Autodesk.Revit.DB.GroupSet.Clear Method

Removes every group from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```